<a href="https://colab.research.google.com/github/Manishrdy/ML-DM_Lab/blob/master/fodscollab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [ ]:
df=pd.read_csv('/content/drive/My Drive/pandasfods/weather_data.csv')

In [ ]:
df.head(6)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.tail(6)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.sample(3)#raaandomly few samples of data frame will be displayed

        day  temperature  windspeed  event
4  1/5/2017           32          4   Rain
0  1/1/2017           32          6   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.shape

(6, 4)

In [ ]:
rows,columns=df.shape#initialization if rows nd columns

In [ ]:
print(columns)

4

In [ ]:
df.columns

Index(['temperature', 'windspeed', 'event'], dtype='object')

In [ ]:
df.dtypes#data types of all the columns

day            object
temperature     int64
windspeed       int64
event          object
dtype: object

In [ ]:
#object=string
#temporary changes
df.set_index('day')
#for permanent changes

KeyError: ignored

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.columns

Index(['temperature', 'windspeed', 'event'], dtype='object')

In [ ]:
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [ ]:
df.reset_index()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.rename(columns={'event':'Event'})

          temperature  windspeed  Event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [ ]:
df.columns

Index(['temperature', 'windspeed', 'event'], dtype='object')

In [ ]:
df.describe(include='all')

        temperature  windspeed event
count      6.000000   6.000000     6
unique          NaN        NaN     3
top             NaN        NaN  Snow
freq            NaN        NaN     2
mean      30.333333   4.666667   NaN
std        3.829708   2.338090   NaN
min       24.000000   2.000000   NaN
25%       28.750000   2.500000   NaN
50%       31.500000   5.000000   NaN
75%       32.000000   6.750000   NaN
max       35.000000   7.000000   NaN

In [ ]:
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [ ]:
df.reset_index()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [ ]:
df['event'].value_counts()

Snow     2
Rain     2
Sunny    2
Name: event, dtype: int64

In [ ]:
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [ ]:
df.reset_index(inplace=True)

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.drop('event',axis=1)

        day  temperature  windspeed
0  1/1/2017           32          6
1  1/2/2017           35          7
2  1/3/2017           28          2
3  1/4/2017           24          7
4  1/5/2017           32          4
5  1/6/2017           31          2

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [ ]:
dd=pd.read_csv("https://raw.githubusercontent.com/pplonski/datasets-for-start/master/credit/data.csv")

In [ ]:
dd

            Id  ...  NumberOfDependents
0            1  ...                 2.0
1            2  ...                 1.0
2            3  ...                 0.0
3            4  ...                 0.0
4            5  ...                 0.0
...        ...  ...                 ...
149995  149996  ...                 0.0
149996  149997  ...                 2.0
149997  149998  ...                 0.0
149998  149999  ...                 0.0
149999  150000  ...                 0.0

[150000 rows x 12 columns]

In [ ]:
dd['DebtRatio']

0            0.802982
1            0.121876
2            0.085113
3            0.036050
4            0.024926
             ...
149995       0.225131
149996       0.716562
149997    3870.000000
149998       0.000000
149999       0.249908
Name: DebtRatio, Length: 150000, dtype: float64

In [ ]:
dd.shape

(150000, 12)

In [ ]:
dd.columns

Index(['Id', 'SeriousDlqin2yrs', 'RevolvingUtilizationOfUnsecuredLines', 'age',
       'NumberOfTime30-59DaysPastDueNotWorse', 'DebtRatio', 'MonthlyIncome',
       'NumberOfOpenCreditLinesAndLoans', 'NumberOfTimes90DaysLate',
       'NumberRealEstateLoansOrLines', 'NumberOfTime60-89DaysPastDueNotWorse',
       'NumberOfDependents'],
      dtype='object')

In [ ]:
dd.dtypes

Id                                        int64
SeriousDlqin2yrs                          int64
RevolvingUtilizationOfUnsecuredLines    float64
age                                       int64
NumberOfTime30-59DaysPastDueNotWorse      int64
DebtRatio                               float64
MonthlyIncome                           float64
NumberOfOpenCreditLinesAndLoans           int64
NumberOfTimes90DaysLate                   int64
NumberRealEstateLoansOrLines              int64
NumberOfTime60-89DaysPastDueNotWorse      int64
NumberOfDependents                      float64
dtype: object

In [ ]:
dd.rename(columns={'id':'Id'})

            Id  ...  NumberOfDependents
0            1  ...                 2.0
1            2  ...                 1.0
2            3  ...                 0.0
3            4  ...                 0.0
4            5  ...                 0.0
...        ...  ...                 ...
149995  149996  ...                 0.0
149996  149997  ...                 2.0
149997  149998  ...                 0.0
149998  149999  ...                 0.0
149999  150000  ...                 0.0

[150000 rows x 12 columns]

In [ ]:
dd.describe()

                  Id  ...  NumberOfDependents
count  150000.000000  ...       146076.000000
mean    75000.500000  ...            0.757222
std     43301.414527  ...            1.115086
min         1.000000  ...            0.000000
25%     37500.750000  ...            0.000000
50%     75000.500000  ...            0.000000
75%    112500.250000  ...            1.000000
max    150000.000000  ...           20.000000

[8 rows x 12 columns]

In [ ]:
dd.dtypes

Id                                        int64
SeriousDlqin2yrs                          int64
RevolvingUtilizationOfUnsecuredLines    float64
age                                       int64
NumberOfTime30-59DaysPastDueNotWorse      int64
DebtRatio                               float64
MonthlyIncome                           float64
NumberOfOpenCreditLinesAndLoans           int64
NumberOfTimes90DaysLate                   int64
NumberRealEstateLoansOrLines              int64
NumberOfTime60-89DaysPastDueNotWorse      int64
NumberOfDependents                      float64
dtype: object

In [ ]:
dd.drop('NumberOfDependents',axis=1)

            Id  ...  NumberOfTime60-89DaysPastDueNotWorse
0            1  ...                                     0
1            2  ...                                     0
2            3  ...                                     0
3            4  ...                                     0
4            5  ...                                     0
...        ...  ...                                   ...
149995  149996  ...                                     0
149996  149997  ...                                     0
149997  149998  ...                                     0
149998  149999  ...                                     0
149999  150000  ...                                     0

[150000 rows x 11 columns]

In [ ]:
dd

            Id  ...  NumberOfDependents
0            1  ...                 2.0
1            2  ...                 1.0
2            3  ...                 0.0
3            4  ...                 0.0
4            5  ...                 0.0
...        ...  ...                 ...
149995  149996  ...                 0.0
149996  149997  ...                 2.0
149997  149998  ...                 0.0
149998  149999  ...                 0.0
149999  150000  ...                 0.0

[150000 rows x 12 columns]

NameError: ignored

In [ ]:
df=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_1.csv')

this is the 2nd class of fods

In [ ]:
df

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
dd=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_2.csv')#no header was there in the csv file

In [ ]:
dd

   2   1500        Good   300000
0  3   1300        Fair   240000
1  3   1900   Very good   450000
2  3   1850         Bad   280000
3  2   1640        Good   310000

In [ ]:
dd=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_2.csv',header=None)

In [ ]:
dd

   0     1           2       3
0  2  1500        Good  300000
1  3  1300        Fair  240000
2  3  1900   Very good  450000
3  3  1850         Bad  280000
4  2  1640        Good  310000

In [ ]:
dd=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_2.csv',header=None,names=['Bedroom','sqft','locality','Price'])

In [ ]:
dd

   Bedroom  sqft    locality   Price
0        2  1500        Good  300000
1        3  1300        Fair  240000
2        3  1900   Very good  450000
3        3  1850         Bad  280000
4        2  1640        Good  310000

In [ ]:
dg=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_3.csv')

In [ ]:
dg

  Bedroom; Sq. foot; Locality; Price ($)
0                  2; 1500; Good; 300000
1                  3; 1300; Fair; 240000
2             3; 1900; Very good; 450000
3                   3; 1850; Bad; 280000
4                  2; 1640; Good; 310000

In [ ]:
dg=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_3.csv',sep=';')

In [ ]:
dg

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
dp=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_1.csv',names=['a','b','c','d'])

In [ ]:
dp

         a          b           c           d
0  Bedroom   Sq. foot    Locality   Price ($)
1        2       1500        Good      300000
2        3       1300        Fair      240000
3        3       1900   Very good      450000
4        3       1850         Bad      280000
5        2       1640        Good      310000

In [ ]:
df5=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_skiprows.csv',skiprows=2)#skiprows from start

In [ ]:
df5

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
df6=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_skipfooter.csv',skiprows=2,skipfooter=1,engine='python')#skipfromlast=skip from last

In [ ]:
df6

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
df7=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_1.csv',nrows=2)#first two rows will be read

In [ ]:
df7

   Bedroom   Sq. foot  Locality   Price ($)
0        2       1500      Good      300000
1        3       1300      Fair      240000

In [ ]:
df8=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_blankline.csv',skip_blank_lines=False)

In [ ]:
df8

   Bedroom   Sq. foot    Locality   Price ($)
0      2.0     1500.0        Good    300000.0
1      3.0     1300.0        Fair    240000.0
2      NaN        NaN         NaN         NaN
3      3.0     1900.0   Very good    450000.0
4      3.0     1850.0         Bad    280000.0
5      NaN        NaN         NaN         NaN
6      2.0     1640.0        Good    310000.0

In [ ]:
df8=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_blankline.csv',skip_blank_lines=True)

In [ ]:
df8

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
zip9=pd.read_csv('/content/drive/My Drive/pandasfods/CSV_EX_1.zip')

In [ ]:
zip9

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
dfsheet1=pd.read_excel('/content/drive/My Drive/pandasfods/Housing_data.xlsx',sheet_name='Data_Tab_1')
dfsheet2=pd.read_excel('/content/drive/My Drive/pandasfods/Housing_data.xlsx',sheet_name='Data_Tab_2')
dfsheet3=pd.read_excel('/content/drive/My Drive/pandasfods/Housing_data.xlsx',sheet_name='Data_Tab_3')

In [ ]:
dfsheet1

      CRIM    ZN  INDUS  CHAS    NOX  ...  TAX  PTRATIO       B  LSTAT  PRICE
0  0.00632  18.0   2.31     0  0.538  ...  296     15.3  396.90   4.98   24.0
1  0.02731   0.0   7.07     0  0.469  ...  242     17.8  396.90   9.14   21.6
2  0.02729   0.0   7.07     0  0.469  ...  242     17.8  392.83   4.03   34.7
3  0.03237   0.0   2.18     0  0.458  ...  222     18.7  394.63   2.94   33.4
4  0.06905   0.0   2.18     0  0.458  ...  222     18.7  396.90   5.33   36.2
5  0.02985   0.0   2.18     0  0.458  ...  222     18.7  394.12   5.21   28.7
6  0.08829  12.5   7.87     0  0.524  ...  311     15.2  395.60  12.43   22.9
7  0.14455  12.5   7.87     0  0.524  ...  311     15.2  396.90  19.15   27.1
8  0.21124  12.5   7.87     0  0.524  ...  311     15.2  386.63  29.93   16.5

[9 rows x 14 columns]

In [ ]:
dtext=pd.read_table('/content/drive/My Drive/pandasfods/Table_EX_1.txt')

In [ ]:
dtext

  Bedroom, Sq. foot, Locality, Price ($)
0                  2, 1500, Good, 300000
1                  3, 1300, Fair, 240000
2             3, 1900, Very good, 450000
3                   3, 1850, Bad, 280000
4                  2, 1640, Good, 310000

In [ ]:
dtext=pd.read_table('/content/drive/My Drive/pandasfods/Table_EX_1.txt',sep=',')

In [ ]:
dtext

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
dtext2=pd.read_table('/content/drive/My Drive/pandasfods/Table_tab_separated.txt')

In [ ]:
dtext2

   Bedroom  Sq. foot   Locality  Price ($)
0        2      1500       Good     300000
1        3      1300       Fair     240000
2        3      1900  Very good     450000
3        3      1850        Bad     280000
4        2      1640       Good     310000

In [ ]:
url='http://www.fdic.gov/bank/individual/failed/banklist.html'
list_of_table=pd.read_html(url)

In [ ]:
list_of_table[0]

                             Bank Name  ...       Closing Date
0                 The First State Bank  ...      April 3, 2020
1                   Ericson State Bank  ...  February 14, 2020
2     City National Bank of New Jersey  ...   November 1, 2019
3                        Resolute Bank  ...   October 25, 2019
4                Louisa Community Bank  ...   October 25, 2019
..                                 ...  ...                ...
556                 Superior Bank, FSB  ...      July 27, 2001
557                Malta National Bank  ...        May 3, 2001
558    First Alliance Bank & Trust Co.  ...   February 2, 2001
559  National State Bank of Metropolis  ...  December 14, 2000
560                   Bank of Honolulu  ...   October 13, 2000

[561 rows x 6 columns]

In [ ]:
url2='https://en.wikipedia.org/wiki/2016_Summer_Olympics_medal_table'
table=pd.read_html(url2)

In [ ]:
for t in table:
  print(t.shape)

(2, 1)
(87, 6)
(10, 9)
(1, 2)
(1, 2)
(4, 2)
(1, 2)

In [ ]:
table[3]

    0                                                  1
0 NaN  Wikimedia Commons has media related to 2016 Su...

In [ ]:
df6=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-red.csv',sep=';')

In [ ]:
df6.shape

(1599, 12)

In [ ]:
df6

      fixed acidity  volatile acidity  citric acid  ...  sulphates  alcohol  quality
0               7.4             0.700         0.00  ...       0.56      9.4        5
1               7.8             0.880         0.00  ...       0.68      9.8        5
2               7.8             0.760         0.04  ...       0.65      9.8        5
3              11.2             0.280         0.56  ...       0.58      9.8        6
4               7.4             0.700         0.00  ...       0.56      9.4        5
...             ...               ...          ...  ...        ...      ...      ...
1594            6.2             0.600         0.08  ...       0.58     10.5        5
1595            5.9             0.550         0.10  ...       0.76     11.2        6
1596            6.3             0.510         0.13  ...       0.75     11.0        6
1597            5.9             0.645         0.12  ...       0.71     10.2        5
1598            6.0             0.310         0.47  ...       0.66     11.0        6

[1599 rows x 12 columns]

In [ ]:
df6.describe

<bound method NDFrame.describe of       fixed acidity  volatile acidity  citric acid  ...  sulphates  alcohol  quality
0               7.4             0.700         0.00  ...       0.56      9.4        5
1               7.8             0.880         0.00  ...       0.68      9.8        5
2               7.8             0.760         0.04  ...       0.65      9.8        5
3              11.2             0.280         0.56  ...       0.58      9.8        6
4               7.4             0.700         0.00  ...       0.56      9.4        5
...             ...               ...          ...  ...        ...      ...      ...
1594            6.2             0.600         0.08  ...       0.58     10.5        5
1595            5.9             0.550         0.10  ...       0.76     11.2        6
1596            6.3             0.510         0.13  ...       0.75     11.0        6
1597            5.9             0.645         0.12  ...       0.71     10.2        5
1598            6.0             0.310         0.47  ...       0.66     11.0        6

[1599 rows x 12 columns]>

In [ ]:
df6.dtypes

fixed acidity           float64
volatile acidity        float64
citric acid             float64
residual sugar          float64
chlorides               float64
free sulfur dioxide     float64
total sulfur dioxide    float64
density                 float64
pH                      float64
sulphates               float64
alcohol                 float64
quality                   int64
dtype: object

In [ ]:
djson=pd.read_json('/content/drive/My Drive/pandasfods/movies.json')

In [ ]:
djson

                                      title  ...                                genres
0                After Dark in Central Park  ...                                    []
1      Boarding School Girls' Pajama Parade  ...                                    []
2            Buffalo Bill's Wild West Parad  ...                                    []
3                                    Caught  ...                                    []
4                      Clowns Spinning Hats  ...                                    []
...                                     ...  ...                                   ...
28790                             Bumblebee  ...  [Action, Adventure, Science Fiction]
28791                     Welcome to Marwen  ...                      [Fantasy, Drama]
28792                     Holmes and Watson  ...             [Action, Mystery, Comedy]
28793                   On the Basis of Sex  ...                    [Biography, Drama]
28794                             Destroyer  ...                     [Crime, Thriller]

[28795 rows x 4 columns]

In [ ]:
pip3 uninstall tabula
pip3 install tabula-py

SyntaxError: ignored

In [ ]:
from tabula import read_pdf

ImportError: ignored

In [ ]:
dfdta=pd.read_stata('/content/drive/My Drive/pandasfods/rscfp2016.dta')

In [ ]:
dfdta

        YY1     Y1          wgt  ...  nwpctlecat  incpctlecat  nincpctlecat
0         1     11  6427.136676  ...           7            1             1
1         1     12  6428.350592  ...           7            1             1
2         1     13  6414.477294  ...           7            1             1
3         1     14  6428.487972  ...           7            1             1
4         1     15  6425.256822  ...           7            1             1
...     ...    ...          ...  ...         ...          ...           ...
31235  6261  62611  4461.752118  ...           5            2             2
31236  6261  62612  4482.258683  ...           5            2             2
31237  6261  62613  4469.827487  ...           5            2             2
31238  6261  62614  4459.960505  ...           5            2             2
31239  6261  62615  4479.387365  ...           5            2             2

[31240 rows x 348 columns]

In [ ]:
dfiloc=pd.read_csv('https://s3-eu-west-1.amazonaws.com/shanebucket/downloads/uk-500.csv')

In [ ]:
dfiloc.head(5)

  first_name  ...                                   web
0    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
1       Evan  ...     http://www.capgeminiamerica.co.uk
2     France  ...      http://www.elliottjohnwesq.co.uk
3    Ulysses  ...          http://www.mcmahanbenl.co.uk
4     Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 11 columns]

In [ ]:
dfiloc.iloc[0]#first row will be selected

first_name                                   Aleshia
last_name                                 Tomkiewicz
company_name                 Alan D Rosenburg Cpa Pc
address                                 14 Taylor St
city                               St. Stephens Ward
county                                          Kent
postal                                       CT2 7PP
phone1                                  01835-703597
phone2                                  01944-369967
email                        atomkiewicz@hotmail.com
web             http://www.alandrosenburgcpapc.co.uk
Name: 0, dtype: object

In [ ]:
dfiloc.iloc[-1]#last row

first_name                                               Mi
last_name                                            Richan
company_name                 Nelson Wright Haworth Golf Crs
address                                     6 Norwood Grove
city                                      Tanworth-in-Arden
county                                         Warwickshire
postal                                              B94 5RZ
phone1                                         01451-785624
phone2                                         01202-738406
email                                        mi@hotmail.com
web             http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: 499, dtype: object

In [ ]:
dfiloc.iloc[2]

first_name                                France
last_name                                Andrade
company_name                 Elliott, John W Esq
address                             8 Moor Place
city              East Southbourne and Tuckton W
county                               Bournemouth
postal                                   BH6 3BE
phone1                              01347-368222
phone2                              01935-821636
email                 france.andrade@hotmail.com
web             http://www.elliottjohnwesq.co.uk
Name: 2, dtype: object

In [ ]:
dfiloc.iloc[:,0]#all rows and the first column

0        Aleshia
1           Evan
2         France
3        Ulysses
4         Tyisha
         ...
495        Avery
496         Reid
497    Charlette
498    Celestina
499           Mi
Name: first_name, Length: 500, dtype: object

In [ ]:
dfiloc.iloc[:,-1]#all rows and the last  column

0             http://www.alandrosenburgcpapc.co.uk
1                http://www.capgeminiamerica.co.uk
2                 http://www.elliottjohnwesq.co.uk
3                     http://www.mcmahanbenl.co.uk
4                   http://www.champagneroom.co.uk
                          ...
495      http://www.plazagourmetdelicatessen.co.uk
496             http://www.fitzgeraldedwardj.co.uk
497               http://www.fureyassociates.co.uk
498         http://www.bfgfederalcreditunion.co.uk
499    http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: web, Length: 500, dtype: object

In [ ]:
pip uninstall tabula

Uninstalling tabula-1.0.5:
  Would remove:
    /usr/local/lib/python3.6/dist-packages/tabula-1.0.5.dist-info/*
    /usr/local/lib/python3.6/dist-packages/tabula/*
  Would not remove (might be manually added):
    /usr/local/lib/python3.6/dist-packages/tabula/errors/__init__.py
    /usr/local/lib/python3.6/dist-packages/tabula/file_util.py
    /usr/local/lib/python3.6/dist-packages/tabula/io.py
    /usr/local/lib/python3.6/dist-packages/tabula/tabula-1.0.3-jar-with-dependencies.jar
    /usr/local/lib/python3.6/dist-packages/tabula/template.py
    /usr/local/lib/python3.6/dist-packages/tabula/util.py
Proceed (y/n)? y
  Successfully uninstalled tabula-1.0.5

In [ ]:
! pip3 install tabula-py

Requirement already satisfied: tabula-py in /usr/local/lib/python3.6/dist-packages (2.1.1)
Requirement already satisfied: pandas>=0.25.3 in /usr/local/lib/python3.6/dist-packages (from tabula-py) (1.0.5)
Requirement already satisfied: numpy in /usr/local/lib/python3.6/dist-packages (from tabula-py) (1.18.5)
Requirement already satisfied: distro in /usr/local/lib/python3.6/dist-packages (from tabula-py) (1.5.0)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.25.3->tabula-py) (2018.9)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.25.3->tabula-py) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas>=0.25.3->tabula-py) (1.12.0)

In [ ]:
from tabula import read_pdf

ImportError: ignored

In [ ]:
dfiloc.iloc[:,0:2]

    first_name   last_name
0      Aleshia  Tomkiewicz
1         Evan   Zigomalas
2       France     Andrade
3      Ulysses   Mcwalters
4       Tyisha      Veness
..         ...         ...
495      Avery        Veit
496       Reid     Euresti
497  Charlette    Brenning
498  Celestina       Keeny
499         Mi      Richan

[500 rows x 2 columns]

In [ ]:
dfiloc.iloc[0:5,:]

  first_name  ...                                   web
0    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
1       Evan  ...     http://www.capgeminiamerica.co.uk
2     France  ...      http://www.elliottjohnwesq.co.uk
3    Ulysses  ...          http://www.mcmahanbenl.co.uk
4     Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 11 columns]

In [ ]:
dfiloc.iloc[0:5,5:8]#first 5 rows and 5,6,7 column

            county    postal        phone1
0             Kent   CT2 7PP  01835-703597
1  Buckinghamshire  HP11 2AX  01937-864715
2      Bournemouth   BH6 3BE  01347-368222
3     Lincolnshire  DN36 5RP  01912-771311
4    West Midlands   B70 9DT  01547-429341

In [ ]:
dfiloc.iloc[[1,3,4],[0,5,6]]

  first_name           county    postal
1       Evan  Buckinghamshire  HP11 2AX
3    Ulysses     Lincolnshire  DN36 5RP
4     Tyisha    West Midlands   B70 9DT

In [ ]:
#loc command
dfiloc.set_index('first_name',inplace=True)
dfiloc.loc[['Evan','Ulysses'],'city':'email']

                          city  ...                     email
first_name                      ...
Evan                Abbey Ward  ...  evan.zigomalas@gmail.com
Ulysses     Hawerby cum Beesby  ...       ulysses@hotmail.com

[2 rows x 6 columns]

In [ ]:
dfiloc.loc['Evan':'Ulysses','city':'email']#: =>range icluding boundaries

                                      city  ...                       email
first_name                                  ...
Evan                            Abbey Ward  ...    evan.zigomalas@gmail.com
France      East Southbourne and Tuckton W  ...  france.andrade@hotmail.com
Ulysses                 Hawerby cum Beesby  ...         ulysses@hotmail.com

[3 rows x 6 columns]

In [ ]:
dfiloc.loc[['Evan','Ulysses'],['city','email']]#it specifies only those specific columns

                          city                     email
first_name
Evan                Abbey Ward  evan.zigomalas@gmail.com
Ulysses     Hawerby cum Beesby       ulysses@hotmail.com

In [ ]:
dfiloc.loc[dfiloc['last_name']=='Andrade','city':'email']#conditional fetchnig

                                      city  ...                       email
first_name                                  ...
France      East Southbourne and Tuckton W  ...  france.andrade@hotmail.com

[1 rows x 6 columns]

In [ ]:
dfiloc[ (dfiloc['last_name']=='Andrade') & (dfiloc['city']=='Abbey Ward') ]

Empty DataFrame
Columns: [last_name, company_name, address, city, county, postal, phone1, phone2, email, web]
Index: []

In [ ]:
dfpencil=pd.read_html('https://www.contextures.com/xlSampleData01.html',skiprows=1)

In [ ]:
dfpencil[0].describe()

               4           5            6
count  43.000000   43.000000    43.000000
mean   49.325581   20.308605   456.462326
std    30.078248   47.345118   447.022104
min     2.000000    1.290000     9.030000
25%    27.500000    3.990000   144.590000
50%    53.000000    4.990000   299.400000
75%    74.500000   17.990000   600.180000
max    96.000000  275.000000  1879.060000

In [ ]:
dfpencil[0].describe(include='all')

                0        1      2       3   4     5       6
count          44       44     44      44  44    44      44
unique         44        4     12       6  38    13      42
top     9/18/2019  Central  Jones  Binder  60  4.99  449.10
freq            1       24      8      15   2    12       2

In [ ]:
dfpencil['UnitCost'].std

TypeError: ignored

In [ ]:
dfpencil=pd.read_html('https://www.espncricinfo.com/india/content/player/253802.html')

In [ ]:
dfpencil[0]

    Unnamed: 0  Mat  Inns  NO   Runs    HS  ...  100  50    4s   6s   Ct  St
0        Tests   86   145  10   7240  254*  ...   27  22   811   22   82   0
1         ODIs  248   239  39  11867   183  ...   43  58  1116  121  128   0
2        T20Is   82    76  21   2794   94*  ...    0  24   258   76   41   0
3  First-class  118   193  17   9489  254*  ...   34  30  1124   37  113   0
4       List A  282   272  42  13309   183  ...   47  66  1280  145  146   0
5         T20s  281   266  50   8900   113  ...    5  64   808  286  128   0

[6 rows x 15 columns]

In [ ]:
#3rd class

#len(df.loc[df.position.str.startswith('Secretary')])

df3=pd.read_csv('https://raw.githubusercontent.com/fivethirtyeight/data/master/cabinet-turnover/cabinet-turnover.csv')

In [ ]:
df3

    president                                  position  ... length   days
0      Carter                              OMB Director  ...    245  247.0
1      Carter               Secretary of Transportation  ...    908  912.0
2      Carter  Secretary of Health, Education & Welfare  ...    920  926.0
3      Carter  Secretary of Housing & Urban Development  ...    922  926.0
4      Carter                 Secretary of the Treasury  ...    923  927.0
..        ...                                       ...  ...    ...    ...
307     Trump            Secretary of Homeland Security  ...    NaN    NaN
308     Trump      Secretary of Health & Human Services  ...    NaN    NaN
309     Trump                        Secretary of State  ...    NaN    NaN
310     Trump                              CIA Director  ...    NaN    NaN
311     Trump             Secretary of Veterans Affairs  ...    NaN    NaN

[312 rows x 7 columns]

In [ ]:
df3['president'].unique

<bound method Series.unique of 0      Carter
1      Carter
2      Carter
3      Carter
4      Carter
        ...
307     Trump
308     Trump
309     Trump
310     Trump
311     Trump
Name: president, Length: 312, dtype: object>

In [ ]:
df3['president'].nunique()

7

In [ ]:
len(df3.loc[df3.position.str.startswith('Secretary')])

175

In [ ]:
df3[(df3.president == 'Clinton') & (df3.position == 'OMB Director')]['appointee']

122    Leon Panetta
129    Alice Rivlin
142    Frank Raines
151        Jack Lew
Name: appointee, dtype: object

In [ ]:
df3.loc[(df3['position']=='OMB Director')& (df3['president']=='Clinton')]['appointee']

122    Leon Panetta
129    Alice Rivlin
142    Frank Raines
151        Jack Lew
Name: appointee, dtype: object

In [ ]:
#date27th

In [ ]:
df=pd.read_csv('/content/drive/My Drive/pandasfods/weather_data.csv',index_col=1)

In [ ]:
df

                  day  windspeed  event
temperature
32           1/1/2017          6   Rain
35           1/2/2017          7  Sunny
28           1/3/2017          2   Snow
24           1/4/2017          7   Snow
32           1/5/2017          4   Rain
31           1/6/2017          2  Sunny

In [ ]:
df=pd.read_csv('/content/drive/My Drive/pandasfods/weather_data.csv',index_col=['day','windspeed'])

In [ ]:
df

                    temperature  event
day      windspeed
1/1/2017 6                   32   Rain
1/2/2017 7                   35  Sunny
1/3/2017 2                   28   Snow
1/4/2017 7                   24   Snow
1/5/2017 4                   32   Rain
1/6/2017 2                   31  Sunny

In [ ]:
df=pd.read_csv('/content/drive/My Drive/pandasfods/weather_data.csv',usecols=['day','windspeed'])#the coumns which you need to fetch

In [ ]:
df

        day  windspeed
0  1/1/2017          6
1  1/2/2017          7
2  1/3/2017          2
3  1/4/2017          7
4  1/5/2017          4
5  1/6/2017          2

In [ ]:
df3=pd.read_csv('/content/drive/My Drive/pandasfods/weather_data.csv',lambda column: column not in ['day','windspeed'])#the coumns which you need to fetch

SyntaxError: ignored

In [ ]:
df3=pd.read_csv('https://raw.githubusercontent.com/akki8087/Big-Mart-Sales/master/Train.csv')

In [ ]:
df3

     Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0              FDA15        9.300  ...  Supermarket Type1          3735.1380
1              DRC01        5.920  ...  Supermarket Type2           443.4228
2              FDN15       17.500  ...  Supermarket Type1          2097.2700
3              FDX07       19.200  ...      Grocery Store           732.3800
4              NCD19        8.930  ...  Supermarket Type1           994.7052
...              ...          ...  ...                ...                ...
8518           FDF22        6.865  ...  Supermarket Type1          2778.3834
8519           FDS36        8.380  ...  Supermarket Type1           549.2850
8520           NCJ29       10.600  ...  Supermarket Type1          1193.1136
8521           FDN46        7.210  ...  Supermarket Type2          1845.5976
8522           DRG01       14.800  ...  Supermarket Type1           765.6700

[8523 rows x 12 columns]

In [ ]:
df3.apply(lambda x:x)#fetch everything from table

     Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0              FDA15        9.300  ...  Supermarket Type1          3735.1380
1              DRC01        5.920  ...  Supermarket Type2           443.4228
2              FDN15       17.500  ...  Supermarket Type1          2097.2700
3              FDX07       19.200  ...      Grocery Store           732.3800
4              NCD19        8.930  ...  Supermarket Type1           994.7052
...              ...          ...  ...                ...                ...
8518           FDF22        6.865  ...  Supermarket Type1          2778.3834
8519           FDS36        8.380  ...  Supermarket Type1           549.2850
8520           NCJ29       10.600  ...  Supermarket Type1          1193.1136
8521           FDN46        7.210  ...  Supermarket Type2          1845.5976
8522           DRG01       14.800  ...  Supermarket Type1           765.6700

[8523 rows x 12 columns]

In [ ]:
df3.apply(lambda x:x[0])#first row

Item_Identifier                          FDA15
Item_Weight                                9.3
Item_Fat_Content                       Low Fat
Item_Visibility                      0.0160473
Item_Type                                Dairy
Item_MRP                               249.809
Outlet_Identifier                       OUT049
Outlet_Establishment_Year                 1999
Outlet_Size                             Medium
Outlet_Location_Type                    Tier 1
Outlet_Type                  Supermarket Type1
Item_Outlet_Sales                      3735.14
dtype: object

In [ ]:
df3.apply(lambda x:x[0],axis=1)

0       FDA15
1       DRC01
2       FDN15
3       FDX07
4       NCD19
        ...
8518    FDF22
8519    FDS36
8520    NCJ29
8521    FDN46
8522    DRG01
Length: 8523, dtype: object

In [ ]:
def clip_price(price):
  if price>200:
    price=200
  return price

In [ ]:
df3['Item_MRP'].apply(lambda x: clip_price(x))[:5]

0    200.0000
1     48.2692
2    141.6180
3    182.0950
4     53.8614
Name: Item_MRP, dtype: float64

In [ ]:
def city_type(city):
  if city=='Tier 1':
    label=0
  if city=='Tier 2':
    label=1
  if city=='Tier 3':
    label=2
  return label

In [ ]:
df3['Outlet_Location_Type']=df3['Outlet_Location_Type'].apply(city_type)

In [ ]:
df3

     Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0              FDA15        9.300  ...  Supermarket Type1          3735.1380
1              DRC01        5.920  ...  Supermarket Type2           443.4228
2              FDN15       17.500  ...  Supermarket Type1          2097.2700
3              FDX07       19.200  ...      Grocery Store           732.3800
4              NCD19        8.930  ...  Supermarket Type1           994.7052
...              ...          ...  ...                ...                ...
8518           FDF22        6.865  ...  Supermarket Type1          2778.3834
8519           FDS36        8.380  ...  Supermarket Type1           549.2850
8520           NCJ29       10.600  ...  Supermarket Type1          1193.1136
8521           FDN46        7.210  ...  Supermarket Type2          1845.5976
8522           DRG01       14.800  ...  Supermarket Type1           765.6700

[8523 rows x 12 columns]

In [ ]:
df4=pd.read_csv('https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv')

In [ ]:
df4

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [ ]:
df4.isnull()

     PID  ST_NUM  ST_NAME  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False   False    False         False         False     False  False
1  False   False    False         False         False     False  False
2  False    True    False         False          True     False  False
3  False   False    False         False         False      True  False
4   True   False    False         False         False     False  False
5  False   False    False         False          True     False  False
6  False    True    False          True         False     False  False
7  False   False    False         False         False     False   True
8  False   False    False         False         False     False  False

In [ ]:
df4['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [ ]:
df4['SQ_FT'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: SQ_FT, dtype: bool

In [ ]:
df4['NUM_BEDROOMS'].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [ ]:
#make a list of missing values
missing_values=["n/a","na","--","Na"]

In [ ]:
df5=pd.read_csv('https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv',na_values=missing_values)

In [ ]:
df5

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:

df5['OWN_OCCUPIED']=df5['OWN_OCCUPIED'].replace(r'[0-9]+',np.nan,regex=True)

In [ ]:
df5

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df5.isnull().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        1
SQ_FT           2
dtype: int64

In [ ]:
df5.isnull().sum().sum()

11

In [ ]:
df5.fillna(0)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     0.0
2  100003000.0     0.0   LEXINGTON            N           0.0        1   850.0
3  100004000.0   201.0    BERKELEY            0           1.0        0   700.0
4          0.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           0.0        1   800.0
6  100007000.0     0.0  WASHINGTON            0           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     0.0
8  100009000.0   215.0     TREMONT            Y           0.0        2  1800.0

In [ ]:
df5

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
#df5.fillna(method='bfill')#backfill
df5.fillna(method='ffill')#forwardfill

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5  1000.0
2  100003000.0   197.0   LEXINGTON            N           3.0        1   850.0
3  100004000.0   201.0    BERKELEY            N           1.0        1   700.0
4  100004000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           3.0        1   800.0
6  100007000.0   207.0  WASHINGTON            Y           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1   950.0
8  100009000.0   215.0     TREMONT            Y           1.0        2  1800.0

In [ ]:
df5.dropna()#null value rows will be deleted

           PID  ST_NUM ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0  PUTNAM            Y           3.0        1  1000.0

In [ ]:
df5.dropna(how='all')#null values for all the entries in a row will be deleted

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df5.dropna(axis=0)#column will be delted

           PID  ST_NUM ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0  PUTNAM            Y           3.0        1  1000.0

In [ ]:
df5.dropna(axis=1)#column will not be deleted

      ST_NAME
0      PUTNAM
1   LEXINGTON
2   LEXINGTON
3    BERKELEY
4    BERKELEY
5    BERKELEY
6  WASHINGTON
7     TREMONT
8     TREMONT

In [ ]:
df5.dropna(axis=1,how ='any')

      ST_NAME
0      PUTNAM
1   LEXINGTON
2   LEXINGTON
3    BERKELEY
4    BERKELEY
5    BERKELEY
6  WASHINGTON
7     TREMONT
8     TREMONT

In [ ]:
df61=pd.read_csv('https://gist.githubusercontent.com/ktisha/c21e73a1bd1700294ef790c56c8aec1f/raw/819b69b5736821ccee93d05b51de0510bea00294/pima-indians-diabetes.csv',skiprows=9,header=None)

In [ ]:
df61

      0    1   2   3    4     5      6   7  8
0     6  148  72  35    0  33.6  0.627  50  1
1     1   85  66  29    0  26.6  0.351  31  0
2     8  183  64   0    0  23.3  0.672  32  1
3     1   89  66  23   94  28.1  0.167  21  0
4     0  137  40  35  168  43.1  2.288  33  1
..   ..  ...  ..  ..  ...   ...    ...  .. ..
763  10  101  76  48  180  32.9  0.171  63  0
764   2  122  70  27    0  36.8  0.340  27  0
765   5  121  72  23  112  26.2  0.245  30  0
766   1  126  60   0    0  30.1  0.349  47  1
767   1   93  70  31    0  30.4  0.315  23  0

[768 rows x 9 columns]

In [ ]:
df61.shape

(768, 1)

In [ ]:
df61.fillna(df61.mean())#each columns mean will be filled instead of NaN

      0    1   2   3    4     5      6   7  8
0     6  148  72  35    0  33.6  0.627  50  1
1     1   85  66  29    0  26.6  0.351  31  0
2     8  183  64   0    0  23.3  0.672  32  1
3     1   89  66  23   94  28.1  0.167  21  0
4     0  137  40  35  168  43.1  2.288  33  1
..   ..  ...  ..  ..  ...   ...    ...  .. ..
763  10  101  76  48  180  32.9  0.171  63  0
764   2  122  70  27    0  36.8  0.340  27  0
765   5  121  72  23  112  26.2  0.245  30  0
766   1  126  60   0    0  30.1  0.349  47  1
767   1   93  70  31    0  30.4  0.315  23  0

[768 rows x 9 columns]

In [ ]:
s=pd.Series([0,1,2,3,4])

In [ ]:
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [ ]:
s.replace([0,1],5)

0    5
1    5
2    2
3    3
4    4
dtype: int64

In [ ]:
df56=pd.DataFrame({'X':[0,12,3,5,6],
                  'Y':[9,6,5,4,23],
                  'Z':[0,4,5,6,7]})

In [ ]:
df56.replace('X':[0], 1)

SyntaxError: ignored

In [ ]:
df61=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-red.csv',sep=';')

In [ ]:
df61

      fixed acidity  volatile acidity  citric acid  ...  sulphates  alcohol  quality
0               7.4             0.700         0.00  ...       0.56      9.4        5
1               7.8             0.880         0.00  ...       0.68      9.8        5
2               7.8             0.760         0.04  ...       0.65      9.8        5
3              11.2             0.280         0.56  ...       0.58      9.8        6
4               7.4             0.700         0.00  ...       0.56      9.4        5
...             ...               ...          ...  ...        ...      ...      ...
1594            6.2             0.600         0.08  ...       0.58     10.5        5
1595            5.9             0.550         0.10  ...       0.76     11.2        6
1596            6.3             0.510         0.13  ...       0.75     11.0        6
1597            5.9             0.645         0.12  ...       0.71     10.2        5
1598            6.0             0.310         0.47  ...       0.66     11.0        6

[1599 rows x 12 columns]

In [ ]:
df61(['alcohol']==9.8 and ['quality']==5)

TypeError: ignored

In [ ]:
df31=pd.read_csv('http://bit.ly/2cLzoxH')

In [ ]:
df31

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 6 columns]

In [ ]:
df31.sort_values('lifeExp').types

AttributeError: ignored

In [ ]:
df31.sort_values('lifeExp',inplace=True)#

In [ ]:
df31

              country  year          pop continent  lifeExp     gdpPercap
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
552            Gambia  1952     284320.0    Africa   30.000    485.230659
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
...               ...   ...          ...       ...      ...           ...
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
803             Japan  2007  127467972.0      Asia   82.603  31656.068060

[1704 rows x 6 columns]

In [ ]:
df31.reset_index()#extra coumn where it is index

      index          country  year  ...  continent lifeExp     gdpPercap
0      1292           Rwanda  1992  ...     Africa  23.599    737.068595
1         0      Afghanistan  1952  ...       Asia  28.801    779.445314
2       552           Gambia  1952  ...     Africa  30.000    485.230659
3        36           Angola  1952  ...     Africa  30.015   3520.610273
4      1344     Sierra Leone  1952  ...     Africa  30.331    879.787736
...     ...              ...   ...  ...        ...     ...           ...
1699   1487      Switzerland  2007  ...     Europe  81.701  37506.419070
1700    695          Iceland  2007  ...     Europe  81.757  36180.789190
1701    802            Japan  2002  ...       Asia  82.000  28604.591900
1702    671  Hong Kong China  2007  ...       Asia  82.208  39724.978670
1703    803            Japan  2007  ...       Asia  82.603  31656.068060

[1704 rows x 7 columns]

In [ ]:
df31.reset_index(drop=True)#original index column got reseted

              country  year          pop continent  lifeExp     gdpPercap
0              Rwanda  1992    7290203.0    Africa   23.599    737.068595
1         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
2              Gambia  1952     284320.0    Africa   30.000    485.230659
3              Angola  1952    4232095.0    Africa   30.015   3520.610273
4        Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
...               ...   ...          ...       ...      ...           ...
1699      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
1700          Iceland  2007     301931.0    Europe   81.757  36180.789190
1701            Japan  2002  127065841.0      Asia   82.000  28604.591900
1702  Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
1703            Japan  2007  127467972.0      Asia   82.603  31656.068060

[1704 rows x 6 columns]

In [ ]:
df31=pd.read_csv('http://bit.ly/2cLzoxH')

In [ ]:
df31.sort_values('lifeExp',ascending=False)#in the decending order

              country  year          pop continent  lifeExp     gdpPercap
803             Japan  2007  127467972.0      Asia   82.603  31656.068060
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
...               ...   ...          ...       ...      ...           ...
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
552            Gambia  1952     284320.0    Africa   30.000    485.230659
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595

[1704 rows x 6 columns]

In [ ]:
df31.sort_values('lifeExp',ascending=False,na_position='first')#if null values are present it will come in first

              country  year          pop continent  lifeExp     gdpPercap
803             Japan  2007  127467972.0      Asia   82.603  31656.068060
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
...               ...   ...          ...       ...      ...           ...
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
552            Gambia  1952     284320.0    Africa   30.000    485.230659
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595

[1704 rows x 6 columns]

In [ ]:
df31.sort_index(inplace=True)

In [ ]:
df31

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 6 columns]

In [ ]:
#sort the data frames by multiple columns
df31.sort_values(['lifeExp','year'],ascending=False,na_position='first')#first according to first column the if the values of th first column specified is same then it is sorted according to second column specified

              country  year          pop continent  lifeExp     gdpPercap
803             Japan  2007  127467972.0      Asia   82.603  31656.068060
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
...               ...   ...          ...       ...      ...           ...
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
552            Gambia  1952     284320.0    Africa   30.000    485.230659
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595

[1704 rows x 6 columns]

In [ ]:
df = pd.DataFrame( {     
"Employee" : ["Susan", "Bart", "Emily", "Charles", "David", "Charles", "Julia", "Bart"] ,           
"City" : ["London", "London", "Philadelphia", "London", "London", "Philadelphia", "London", "Philadelphia"] ,
"Age" : [20, 40, 18, 24, 37, 40, 44, 20 ],
"Hours" : [24, 40, 50, 36, 54, 44, 41, 35]} )

In [ ]:
df

  Employee          City  Age  Hours
0    Susan        London   20     24
1     Bart        London   40     40
2    Emily  Philadelphia   18     50
3  Charles        London   24     36
4    David        London   37     54
5  Charles  Philadelphia   40     44
6    Julia        London   44     41
7     Bart  Philadelphia   20     35

In [ ]:
df45=pd.read_csv('/content/drive/My Drive/pandasfods/weather_by_cities.csv')

In [ ]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [ ]:
df.groupby(['Employee']).sum()

          Age  Hours
Employee
Bart       60     75
Charles    64     80
David      37     54
Emily      18     50
Julia      44     41
Susan      20     24

In [ ]:
df.groupby(['City']).sum()

              Age  Hours
City
London        165    195
Philadelphia   78    129

In [ ]:
df.groupby(['City']).count()

              Employee  Age  Hours
City
London               5    5      5
Philadelphia         3    3      3

In [ ]:
grouped=df.groupby(['Employee','City'])#group by command against multiple columns

In [ ]:
grouped.first()

                       Age  Hours
Employee City
Bart     London         40     40
         Philadelphia   20     35
Charles  London         24     36
         Philadelphia   40     44
David    London         37     54
Emily    Philadelphia   18     50
Julia    London         44     41
Susan    London         20     24

In [ ]:
df45

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [ ]:
g=df45.groupby(['city'])

In [ ]:
g

In [ ]:
g.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [ ]:
for city,data in g:
  print(city,"/n")
  print(data,"/n")

mumbai /n
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain /n
new york /n
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny /n
paris /n
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy /n

In [ ]:
g.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [ ]:
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [ ]:
g.min()

               day  temperature  windspeed   event
city
mumbai    1/1/2017           85          5     Fog
new york  1/1/2017           28          6    Rain
paris     1/1/2017           42          8  Cloudy

In [ ]:
g.describe()

         temperature                         ... windspeed
               count   mean       std   min  ...       25%   50%    75%   max
city                                         ...
mumbai           4.0  88.50  3.109126  85.0  ...      5.00   8.5  12.75  15.0
new york         4.0  32.25  3.304038  28.0  ...      6.75   7.0   8.25  12.0
paris            4.0  47.75  5.315073  42.0  ...      9.50  11.5  14.75  20.0

[3 rows x 16 columns]

In [ ]:
g.size()

city
mumbai      4
new york    4
paris       4
dtype: int64

In [ ]:
g.count()

          day  temperature  windspeed  event
city
mumbai      4            4          4      4
new york    4            4          4      4
paris       4            4          4      4

In [ ]:
df55 = pd.DataFrame({
    'user_id':[1,2,1,3,3,],
    'content_id':[1,1,2,2,2],
    'tag':['cool','nice','clever','clever','not-bad']
})

In [ ]:
df55

   user_id  content_id      tag
0        1           1     cool
1        2           1     nice
2        1           2   clever
3        3           2   clever
4        3           2  not-bad

In [ ]:
df55.groupby('content_id')['tag'].apply(lambda tags:','.join(tags))

content_id
1                cool,nice
2    clever,clever,not-bad
Name: tag, dtype: object

In [ ]:
df55.groupby('content_id')['user_id'].nunique()#number unique userids for a city which is grouped

content_id
1    2
2    2
Name: user_id, dtype: int64

In [ ]:
df55.groupby('content_id')['user_id'].nunique().to_frame()#when we want as a data frame

            user_id
content_id
1                 2
2                 2

In [ ]:
df55.groupby('content_id')['user_id'].nunique().to_frame().reset_index()#index column will be added

   content_id  user_id
0           1        2
1           2        2

In [ ]:
df77 = pd.DataFrame({
    'value':[20.45,22.89,32.12,111.22,33.22,100.00,99.99],
    'product':['table','chair','chair','mobile phone','table','mobile phone','table']
})

In [ ]:
df77

    value       product
0   20.45         table
1   22.89         chair
2   32.12         chair
3  111.22  mobile phone
4   33.22         table
5  100.00  mobile phone
6   99.99         table

In [ ]:
df77.groupby('product')['value'].sum().to_frame().reset_index()

        product   value
0         chair   55.01
1  mobile phone  211.22
2         table  153.66

In [ ]:
df77.groupby('product')['value'].sum().to_frame().reset_index().sort_values(by='value')

        product   value
0         chair   55.01
2         table  153.66
1  mobile phone  211.22

In [ ]:
df78 = pd.DataFrame({
    'value':[20.45,22.89,32.12,111.22,33.22,100.00,99.99],
    'product':['table','chair','chair','mobile phone','table','mobile phone','table']
})

In [ ]:
df78

    value       product
0   20.45         table
1   22.89         chair
2   32.12         chair
3  111.22  mobile phone
4   33.22         table
5  100.00  mobile phone
6   99.99         table

In [ ]:
#date 3rd august
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

In [ ]:
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [ ]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
 
 
 
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],'hire_date': [2004, 2008, 2012, 2014]})



df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],'supervisor': ['Carly', 'Guido', 'Steve']})
 
 
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})
 
 
 
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'salary': [70000, 80000, 120000, 90000]})
 
 
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],'food': ['fish', 'beans', 'bread']},columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
 
 
 
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'rank': [1, 2, 3, 4]})
 
 
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'rank': [3, 1, 4, 2]})

In [ ]:
df9

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [ ]:
display('df3','df4',"pd.concat([df3,df4],axis=0)")#join=outer by default....

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

pd.concat([df3,df4],axis=0)
   name    salary        group supervisor
0   Bob   70000.0          NaN        NaN
1  Jake   80000.0          NaN        NaN
2  Lisa  120000.0          NaN        NaN
3   Sue   90000.0          NaN        NaN
0   NaN       NaN   Accounting      Carly
1   NaN       NaN  Engineering      Guido
2   NaN       NaN           HR      Steve

In [ ]:
display('df3','df4',"pd.concat([df3,df4],axis=1)")

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

pd.concat([df3,df4],axis=1)
   name  salary        group supervisor
0   Bob   70000   Accounting      Carly
1  Jake   80000  Engineering      Guido
2  Lisa  120000           HR      Steve
3   Sue   90000          NaN        NaN

In [ ]:
x=make_df('AB',[0,1])
y=make_df('AB',[2,3])
display('x','y',"pd.concat([x,y],axis=0)")

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
2  A2  B2
3  A3  B3

pd.concat([x,y],axis=0)
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [ ]:
display('x','y',"pd.concat([x,y],ignore_index=True)")

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
2  A2  B2
3  A3  B3

pd.concat([x,y],ignore_index=True)
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [ ]:
display('x','y',"pd.concat([x,y],keys=['x','y'])")

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
2  A2  B2
3  A3  B3

pd.concat([x,y],keys=['x','y'])
      A   B
x 0  A0  B0
  1  A1  B1
y 2  A2  B2
  3  A3  B3

In [ ]:
display('x','y',"pd.concat([x,y],join='inner')")#common things will be given...

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
2  A2  B2
3  A3  B3

pd.concat([x,y],join='inner')
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [ ]:
display('x','y',"pd.concat([x,y],join='outer')")

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
2  A2  B2
3  A3  B3

pd.concat([x,y],join='outer')
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [ ]:
display('df5','df6',"pd.concat([df5,df6],join_axes=[df5.columns])")

TypeError: ignored

TypeError: ignored

In [ ]:
#append and concat are functionally same and merge and join are same.
display('df1','df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [ ]:
#merge function
df55=pd.merge(df1,df2)
df55

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [ ]:
#many to one join
df56=pd.merge(df55,df4)

In [ ]:
display('df1','df2','df55','pd.merge(df55,df4)')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

df55
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

pd.merge(df55,df4)
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [ ]:
#many to many
display('df1','df5','pd.merge(df1,df5)')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

pd.merge(df1,df5)
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [ ]:
#on pararmeter
#left on means df on the left side based on which it has to merge and same is case for right_on
display('df1','df3','pd.merge(df1,df3,left_on="employee",right_on="name")')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1,df3,left_on="employee",right_on="name")
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [ ]:
pd.merge(df1,df3,left_on="employee",right_on="name").drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [ ]:
df1a=df1.set_index('employee')
df2a=df2.set_index('employee')
display('df1a','df2a')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [ ]:
display('df1a','df2a','pd.merge(df1a,df2a,left_index=True,right_index=True)')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(df1a,df2a,left_index=True,right_index=True)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [ ]:
display('df1a','df3','pd.merge(df1a,df3,left_index=True,right_on="name")')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1a,df3,left_index=True,right_on="name")
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [ ]:
display('pd.merge(df6,df7,how="inner")')

pd.merge(df6,df7,how="inner")
   name   food drink
0  Mary  bread  wine

In [ ]:
display('df6','df7','pd.merge(df6,df7,how="right")')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6,df7,how="right")
     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [ ]:
display('df6','df7','pd.merge(df6,df7,how="left")')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6,df7,how="left")
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [ ]:
display('df6','df7','pd.merge(df6,df7,how="outer")')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6,df7,how="outer")
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [ ]:
display('df8','df9','pd.merge(df8,df9,on="name")')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8,df9,on="name")
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [ ]:
display('df8','df9','pd.merge(df8,df9,on="name",suffixes=["_L","_R"])')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8,df9,on="name",suffixes=["_L","_R"])
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [ ]:
#aug 4
d = pd.DataFrame({
    "Item": ['Item0', 'Item0', 'Item1', 'Item1'],
    "CType":['Gold', 'Bronze', 'Gold', 'Silver'],
    "USD":  ['1$', '2$', '3$', '4$'],
    "EU":  ['1€', '2€', '3€', '4€']
})

In [ ]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [ ]:
#restructure my table
p=d.pivot(index='Item',columns='CType',values='USD')

ValueError: ignored

In [ ]:
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$

In [ ]:
print(p[p.index=='Item0'].Gold.values)

['1$']

In [ ]:
p=d.pivot(index='Item',columns='CType')

In [ ]:
p

         USD                 EU
CType Bronze Gold Silver Bronze Gold Silver
Item
Item0     2$   1$    NaN     2€   1€    NaN
Item1    NaN   3$     4$    NaN   3€     4€

In [ ]:
print(p.USD[p.index=='Item0'].Gold.values)

['1$']

In [ ]:
#aug 4
d = pd.DataFrame({
    "Item": ['Item0', 'Item0', 'Item0', 'Item1'],
    "CType":['Gold', 'Bronze', 'Gold', 'Silver'],
    "USD":  [1, 2, 3, 4],
    "EU":  [1.1, 2.2, 3.3, 4.4]
})

In [ ]:
d

    Item   CType  USD   EU
0  Item0    Gold    1  1.1
1  Item0  Bronze    2  2.2
2  Item0    Gold    3  3.3
3  Item1  Silver    4  4.4

In [ ]:
p=d.pivot(index='Item',columns='CType',values='USD')

ValueError: ignored

In [ ]:
p=d.pivot_table(index='Item',columns='CType',values='USD',aggfunc=np.mean)

In [ ]:
p

CType  Bronze  Gold  Silver
Item
Item0     2.0   2.0     NaN
Item1     NaN   NaN     4.0

In [ ]:
df=pd.read_csv('/content/drive/My Drive/pandasfods/weather.csv')

In [ ]:
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [ ]:
p=df.pivot_table(index='city',columns='date',values='humidity')

In [ ]:
p

date      5/1/2017  5/2/2017  5/3/2017
city
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

In [ ]:
p.index.name=None

In [ ]:
p

date      5/1/2017  5/2/2017  5/3/2017
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

In [ ]:
p.columns.name=None

In [ ]:
p

          5/1/2017  5/2/2017  5/3/2017
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

In [ ]:
df33=pd.read_csv('/content/drive/My Drive/pandasfods/weather2.csv')

In [ ]:
df33

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/1/2017  new york           61        54
2  5/2/2017  new york           70        60
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80
5  5/1/2017    mumbai           78        83
6  5/2/2017    mumbai           82        85
7  5/2/2017    mumbai           80        26

In [ ]:
df33.pivot_table(index='city',columns='date')#mean is the aggfunc

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai       81.5     55.5        76.5     81.0
new york     55.0     61.0        63.0     71.0

In [ ]:
df33.pivot_table(index='city',columns='date',aggfunc=min)

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai         80       26          75       80
new york       54       60          61       70

In [ ]:
df33.pivot_table(index='city',columns='date',aggfunc=np.sum,margins=True)#extra column will be there with the aggregate funcction

         humidity               temperature
date     5/1/2017 5/2/2017  All    5/1/2017 5/2/2017  All
city
mumbai        163      111  274         153      162  315
new york      110      122  232         126      142  268
All           273      233  506         279      304  583

In [ ]:
df34=pd.read_csv('/content/drive/My Drive/pandasfods/weather3.csv')

In [ ]:
df34.dtypes

date           object
city           object
temperature     int64
humidity        int64
dtype: object

In [ ]:
df34

        date      city  temperature  humidity
0   5/1/2017  new york           65        56
1   5/2/2017  new york           61        54
2   5/3/2017  new york           70        60
3  12/1/2017  new york           30        50
4  12/2/2017  new york           28        52
5  12/3/2017  new york           25        51

In [ ]:
df34['date']=pd.to_datetime(df34['date'])

In [ ]:
df34.dtypes

date           datetime64[ns]
city                   object
temperature             int64
humidity                int64
dtype: object

In [ ]:
df34.pivot_table(index=pd.Grouper(freq='M',key='date'),columns='city')

             humidity temperature
city         new york    new york
date
2017-05-31  56.666667   65.333333
2017-12-31  51.000000   27.666667

In [ ]:
df45=pd.read_csv('https://theunitedstates.io/congress-legislators/legislators-historical.csv')

In [ ]:
df45

       last_name  ...                              wikipedia_id
0        Bassett  ...              Richard Bassett (politician)
1          Bland  ...            Theodorick Bland (congressman)
2          Burke  ...                             Aedanus Burke
3        Carroll  ...                            Daniel Carroll
4         Clymer  ...                             George Clymer
...          ...  ...                                       ...
11977    Isakson  ...                            Johnny Isakson
11978     Hunter  ...                          Duncan D. Hunter
11979    Meadows  ...  Mark Meadows (North Carolina politician)
11980  Ratcliffe  ...      John Ratcliffe (American politician)
11981      Lewis  ...          John Lewis (civil rights leader)

[11982 rows x 34 columns]

In [ ]:
df44=df45['last_name']

In [ ]:
len(df45[df45['state']=='AR']['last_name'])

117

In [ ]:
len(df45[(df45['gender']=='F') & (df45['state']=='WY')])

2

In [ ]:
sum(df45[df45['last_name']=='Abbott']['govtrack_id'])

2404011

In [ ]:
sum(df45[df45['last_name']=='Abbott']['govtrack_id'])

2404011

In [ ]:
sum(df45[df45['last_name']=='Abbott']['icpsr_id'])

33.0

In [ ]:
df34=pd.read_excel('/content/drive/My Drive/pandasfods/stocks.xlsx',header=[0,1],index_col=0)

In [ ]:
df34

              Price         ... Price to earnings ratio (P/E)
Company    Facebook Google  ...                        Google Microsoft
2017-06-05      155    955  ...                          32.0     30.31
2017-06-06      150    987  ...                          31.3     30.56
2017-06-07      153    963  ...                          31.7     30.46
2017-06-08      155   1000  ...                          31.2     30.11
2017-06-09      156   1012  ...                          30.0     31.00

[5 rows x 6 columns]

In [ ]:
df34.stack()

                      Price  Price to earnings ratio (P/E)
           Company
2017-06-05 Facebook     155                          37.10
           Google       955                          32.00
           Microsoft     66                          30.31
2017-06-06 Facebook     150                          36.98
           Google       987                          31.30
           Microsoft     69                          30.56
2017-06-07 Facebook     153                          36.78
           Google       963                          31.70
           Microsoft     62                          30.46
2017-06-08 Facebook     155                          36.11
           Google      1000                          31.20
           Microsoft     61                          30.11
2017-06-09 Facebook     156                          37.07
           Google      1012                          30.00
           Microsoft     66                          31.00

In [ ]:
df34.stack(level=0)

Company                                   Facebook  Google  Microsoft
2017-06-05 Price                            155.00   955.0      66.00
           Price to earnings ratio (P/E)     37.10    32.0      30.31
2017-06-06 Price                            150.00   987.0      69.00
           Price to earnings ratio (P/E)     36.98    31.3      30.56
2017-06-07 Price                            153.00   963.0      62.00
           Price to earnings ratio (P/E)     36.78    31.7      30.46
2017-06-08 Price                            155.00  1000.0      61.00
           Price to earnings ratio (P/E)     36.11    31.2      30.11
2017-06-09 Price                            156.00  1012.0      66.00
           Price to earnings ratio (P/E)     37.07    30.0      31.00

In [ ]:
df34.stack(level=1)#bydefault this

                      Price  Price to earnings ratio (P/E)
           Company
2017-06-05 Facebook     155                          37.10
           Google       955                          32.00
           Microsoft     66                          30.31
2017-06-06 Facebook     150                          36.98
           Google       987                          31.30
           Microsoft     69                          30.56
2017-06-07 Facebook     153                          36.78
           Google       963                          31.70
           Microsoft     62                          30.46
2017-06-08 Facebook     155                          36.11
           Google      1000                          31.20
           Microsoft     61                          30.11
2017-06-09 Facebook     156                          37.07
           Google      1012                          30.00
           Microsoft     66                          31.00

In [ ]:
df34.unstack()

                               Company
Price                          Facebook   2017-06-05     155.00
                                          2017-06-06     150.00
                                          2017-06-07     153.00
                                          2017-06-08     155.00
                                          2017-06-09     156.00
                               Google     2017-06-05     955.00
                                          2017-06-06     987.00
                                          2017-06-07     963.00
                                          2017-06-08    1000.00
                                          2017-06-09    1012.00
                               Microsoft  2017-06-05      66.00
                                          2017-06-06      69.00
                                          2017-06-07      62.00
                                          2017-06-08      61.00
                                          2017-06-09      66.00
Price to earnings ratio (P/E)  Facebook   2017-06-05      37.10
                                          2017-06-06      36.98
                                          2017-06-07      36.78
                                          2017-06-08      36.11
                                          2017-06-09      37.07
                               Google     2017-06-05      32.00
                                          2017-06-06      31.30
                                          2017-06-07      31.70
                                          2017-06-08      31.20
                                          2017-06-09      30.00
                               Microsoft  2017-06-05      30.31
                                          2017-06-06      30.56
                                          2017-06-07      30.46
                                          2017-06-08      30.11
                                          2017-06-09      31.00
dtype: float64

In [ ]:
df34=pd.read_excel('/content/drive/My Drive/pandasfods/stocks_3_levels.xlsx',header=[0,1,2],index_col=0)

In [ ]:
df34

        Price Ratios                   ... Income Statement
               Price                   ...       Net Profit
Company     Facebook Google Microsoft  ...         Facebook Google Microsoft
Q1 2016          155    955        66  ...             0.80   5.43      4.56
Q2 2016          150    987        69  ...             0.97   5.89      5.10
Q3 2016          153    963        62  ...             1.20   6.10      5.43
Q4 2016          155   1000        61  ...             1.67   6.50      5.89
Q1 2017          156   1012        66  ...             2.03   6.40      6.09

[5 rows x 12 columns]

In [ ]:
d344=pd.read_csv('https://raw.githubusercontent.com/shanealynn/Pandas-Merge-Tutorial/master/user_usage.csv')

In [ ]:
d344

     outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                      21.97                    4.82     1557.33   22787
1                    1710.08                  136.88     7267.55   22788
2                    1710.08                  136.88     7267.55   22789
3                      94.46                   35.17      519.12   22790
4                      71.59                   79.26     1557.33   22792
..                       ...                     ...         ...     ...
235                   260.66                   68.44      896.96   25008
236                    97.12                   36.50     2815.00   25040
237                   355.93                   12.37     6828.09   25046
238                   632.06                  120.46     1453.16   25058
239                   488.70                  906.92     3089.85   25220

[240 rows x 4 columns]

In [ ]:
d444=pd.read_csv('https://raw.githubusercontent.com/shanealynn/Pandas-Merge-Tutorial/master/user_device.csv')

In [ ]:
d444

     use_id  user_id  ...                  device  use_type_id
0     22782    26980  ...               iPhone7,2            2
1     22783    29628  ...                 Nexus 5            3
2     22784    28473  ...                SM-G903F            1
3     22785    15200  ...               iPhone7,2            3
4     22786    28239  ...               ONE E1003            1
..      ...      ...  ...                     ...          ...
267   23049    29725  ...                SM-G900F            1
268   23050    29726  ...               iPhone7,2            3
269   23051    29726  ...               iPhone7,2            3
270   23052    29727  ...               iPhone8,4            3
271   23053    20257  ...  Vodafone Smart ultra 6            1

[272 rows x 6 columns]

In [ ]:
df555=pd.read_csv('https://raw.githubusercontent.com/shanealynn/Pandas-Merge-Tutorial/master/android_devices.csv')

In [ ]:
df4444=pd.merge(d344,d444,df555)

ValueError: ignored

In [ ]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],} 
 
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

In [ ]:
one = pd.DataFrame({
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'Marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])

two = pd.DataFrame({
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'Marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])

In [ ]:
pd.merge(one,two,how='outer')

     Name subject_id  Marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78
5   Billy       sub2            89
6   Brian       sub4            80
7    Bran       sub3            79
8   Bryce       sub6            97
9   Betty       sub5            88

In [ ]:
pd.concat([one,two])

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [ ]:
df45=pd.read_csv('http://files.zillowstatic.com/research/public_v2/invt_fs/Metro_invt_fs_uc_sfrcondo_smoothed_month.csv')

In [ ]:
df45

     RegionID  SizeRank  ... 2020-05-31 2020-06-30
0      102001         0  ...  1471201.0  1488009.0
1      394913         1  ...    75283.0    76256.0
2      753899         2  ...    22089.0    22858.0
3      394463         3  ...    42661.0    43537.0
4      394514         4  ...    33013.0    33720.0
..        ...       ...  ...        ...        ...
116    394586       504  ...      250.0      263.0
117    394309       527  ...      208.0      203.0
118    394742       595  ...      368.0      373.0
119    395091       641  ...      240.0      238.0
120    395230       672  ...      105.0      105.0

[121 rows x 38 columns]

In [ ]:
df46=pd.read_csv('/content/drive/My Drive/pandasfods/weather (1).csv')

In [ ]:
df46

         day  chicago  chennai  berlin
0     Monday       32       75      41
1    Tuesday       30       77      43
2  Wednesday       28       75      45
3   Thursday       22       82      38
4     Friday       30       83      30
5   Saturday       20       81      45
6     Sunday       25       77      47

In [ ]:
df46=pd.melt(df46,id_vars=["day"])

In [ ]:
df46#by default the variabel and value is kept as default

          day variable  value
0      Monday  chicago     32
1     Tuesday  chicago     30
2   Wednesday  chicago     28
3    Thursday  chicago     22
4      Friday  chicago     30
5    Saturday  chicago     20
6      Sunday  chicago     25
7      Monday  chennai     75
8     Tuesday  chennai     77
9   Wednesday  chennai     75
10   Thursday  chennai     82
11     Friday  chennai     83
12   Saturday  chennai     81
13     Sunday  chennai     77
14     Monday   berlin     41
15    Tuesday   berlin     43
16  Wednesday   berlin     45
17   Thursday   berlin     38
18     Friday   berlin     30
19   Saturday   berlin     45
20     Sunday   berlin     47

In [ ]:
melted=pd.melt(df46,id_vars=["day"],var_name='city',value_name='temperature')

In [ ]:
melted

          day     city  temperature
0      Monday  chicago           32
1     Tuesday  chicago           30
2   Wednesday  chicago           28
3    Thursday  chicago           22
4      Friday  chicago           30
5    Saturday  chicago           20
6      Sunday  chicago           25
7      Monday  chennai           75
8     Tuesday  chennai           77
9   Wednesday  chennai           75
10   Thursday  chennai           82
11     Friday  chennai           83
12   Saturday  chennai           81
13     Sunday  chennai           77
14     Monday   berlin           41
15    Tuesday   berlin           43
16  Wednesday   berlin           45
17   Thursday   berlin           38
18     Friday   berlin           30
19   Saturday   berlin           45
20     Sunday   berlin           47

In [ ]:
df_unmelted=melted.pivot(index='day',columns='city')

In [ ]:
df_unmelted

          temperature
city           berlin chennai chicago
day
Friday             30      83      30
Monday             41      75      32
Saturday           45      81      20
Sunday             47      77      25
Thursday           38      82      22
Tuesday            43      77      30
Wednesday          45      75      28

In [ ]:
df45

     RegionID  SizeRank  ... 2020-05-31 2020-06-30
0      102001         0  ...  1471201.0  1488009.0
1      394913         1  ...    75283.0    76256.0
2      753899         2  ...    22089.0    22858.0
3      394463         3  ...    42661.0    43537.0
4      394514         4  ...    33013.0    33720.0
..        ...       ...  ...        ...        ...
116    394586       504  ...      250.0      263.0
117    394309       527  ...      208.0      203.0
118    394742       595  ...      368.0      373.0
119    395091       641  ...      240.0      238.0
120    395230       672  ...      105.0      105.0

[121 rows x 38 columns]

In [ ]:
df_unmelted.index.name=None

In [ ]:
df_unmelted

          temperature
city           berlin chennai chicago
Friday             30      83      30
Monday             41      75      32
Saturday           45      81      20
Sunday             47      77      25
Thursday           38      82      22
Tuesday            43      77      30
Wednesday          45      75      28

In [ ]:
df_unmelted.columns.name=None

In [ ]:
df_unmelted

          temperature
city           berlin chennai chicago
Friday             30      83      30
Monday             41      75      32
Saturday           45      81      20
Sunday             47      77      25
Thursday           38      82      22
Tuesday            43      77      30
Wednesday          45      75      28

In [ ]:
melt_1=pd.melt(df45,id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'],var_name='year_val',value_name='counts')

In [ ]:
melt_1

      RegionID  SizeRank  ...    year_val     counts
0       102001         0  ...  2017-10-31  1660657.0
1       394913         1  ...  2017-10-31    82960.0
2       753899         2  ...  2017-10-31    25402.0
3       394463         3  ...  2017-10-31    47461.0
4       394514         4  ...  2017-10-31    29470.0
...        ...       ...  ...         ...        ...
3988    394586       504  ...  2020-06-30      263.0
3989    394309       527  ...  2020-06-30      203.0
3990    394742       595  ...  2020-06-30      373.0
3991    395091       641  ...  2020-06-30      238.0
3992    395230       672  ...  2020-06-30      105.0

[3993 rows x 7 columns]

In [ ]:
melt_1.shape

(3993, 7)

In [ ]:
melt_1.dtypes

RegionID        int64
SizeRank        int64
RegionName     object
RegionType     object
StateName      object
year_val       object
counts        float64
dtype: object

In [ ]:
melt_1['year_val'].str.split('-').head()

0    [2017, 10, 31]
1    [2017, 10, 31]
2    [2017, 10, 31]
3    [2017, 10, 31]
4    [2017, 10, 31]
Name: year_val, dtype: object

In [ ]:
melt_1[['year','month','date']]=melt_1['year_val'].str.split('-',expand=True).head()

In [ ]:
melt_1

      RegionID  SizeRank                          RegionName  ...  year month date
0       102001         0                       United States  ...  2017    10   31
1       394913         1                        New York, NY  ...  2017    10   31
2       753899         2  Los Angeles-Long Beach-Anaheim, CA  ...  2017    10   31
3       394463         3                         Chicago, IL  ...  2017    10   31
4       394514         4               Dallas-Fort Worth, TX  ...  2017    10   31
...        ...       ...                                 ...  ...   ...   ...  ...
3988    394586       504                       Faribault, MN  ...   NaN   NaN  NaN
3989    394309       527                       Albemarle, NC  ...   NaN   NaN  NaN
3990    394742       595                       Kerrville, TX  ...   NaN   NaN  NaN
3991    395091       641                     Shelbyville, TN  ...   NaN   NaN  NaN
3992    395230       672                      Wilmington, OH  ...   NaN   NaN  NaN

[3993 rows x 10 columns]

In [ ]:
melt_1.drop(columns=['year_val'],inplace=True,axis=1)

In [ ]:
melt_1

      RegionID  SizeRank                          RegionName  ...  year month  date
0       102001         0                       United States  ...  2017    10    31
1       394913         1                        New York, NY  ...  2017    10    31
2       753899         2  Los Angeles-Long Beach-Anaheim, CA  ...  2017    10    31
3       394463         3                         Chicago, IL  ...  2017    10    31
4       394514         4               Dallas-Fort Worth, TX  ...  2017    10    31
...        ...       ...                                 ...  ...   ...   ...   ...
3988    394586       504                       Faribault, MN  ...   NaN   NaN   NaN
3989    394309       527                       Albemarle, NC  ...   NaN   NaN   NaN
3990    394742       595                       Kerrville, TX  ...   NaN   NaN   NaN
3991    395091       641                     Shelbyville, TN  ...   NaN   NaN   NaN
3992    395230       672                      Wilmington, OH  ...   NaN   NaN   NaN

[3993 rows x 9 columns]